SET SQL_SAFE_UPDATES = 0;
# insert
insert into `mydb`.`supplier` values
	('oldtomato','password','老番茄','男',35,'13279084'),
    ('A','password','老番茄','男',35,'13279084'),
    ('B','password','老番茄','男',35,'13279084'),
    ('C','password','老番茄','男',35,'13279084'),
    ('D','password','老番茄','男',35,'13279084'),
    ('E','password','老番茄','男',35,'13279084'),
	('F','password','老番茄','男',35,'13279084'),
    ('G','password','老番茄','男',35,'13279084'),
    ('H','password','老番茄','男',35,'13279084'),
    ('I','password','老番茄','男',35,'13279084');
insert into `mydb`.`customer`(id,`password`,`name`,sex,age,tel,points) values
    ('consumer1','password','用户1','男',80,'12345678',50), # consumer1
	('consumer2','password','用户2','男',10,'12345678',98), # consumer2
	('consumer3','password','用户3','男',20,'12345678',50),
	('consumer4','password','用户4','男',20,'12345678',50),
	('consumer5','password','用户5','男',20,'12345678',50),
	('consumer6','password','用户6','男',20,'12345678',50),
	('consumer7','password','用户7','男',20,'12345678',50),
	('consumer8','password','用户8','男',20,'12345678',50),
	('consumer9','password','用户9','男',20,'12345678',50),
	('consumer10','password','用户10','男',20,'12345678',50),
	('consumer11','password','用户11','男',20,'12345678',50),
	('consumer12','password','用户12','男',20,'12345678',50),
	('consumer13','password','用户13','男',20,'12345678',50),
	('consumer14','password','用户14','男',20,'12345678',50),
	('consumer15','password','用户15','男',20,'12345678',50),
	('consumer16','password','用户16','男',20,'12345678',50),
	('consumer17','password','用户17','男',20,'12345678',50),
	('consumer18','password','用户18','男',20,'12345678',50),
	('consumer19','password','用户19','男',20,'12345678',50),
	('consumer20','password','用户20','男',20,'12345678',50),
	('consumer21','password','用户21','男',20,'12345678',50),
	('consumer22','password','用户22','男',20,'12345678',50),
	('consumer23','password','用户23','男',20,'12345678',50),
	('consumer24','password','用户24','男',20,'12345678',50),
	('consumer25','password','用户25','男',20,'12345678',50),
	('consumer26','password','用户26','男',20,'12345678',50),
	('consumer27','password','用户27','男',20,'12345678',50),
	('consumer28','password','用户28','男',20,'12345678',50),
	('consumer29','password','用户29','男',20,'12345678',50),
	('consumer30','password','用户30','男',20,'12345678',50),
	('consumer31','password','用户31','男',20,'12345678',50),
	('consumer32','password','用户32','男',20,'12345678',50),
	('consumer33','password','用户33','男',20,'12345678',50),
	('consumer34','password','用户34','男',20,'12345678',50),
	('consumer35','password','用户35','男',20,'12345678',50),
	('consumer36','password','用户36','男',20,'12345678',50),
	('consumer37','password','用户37','男',20,'12345678',50),
	('consumer38','password','用户38','男',20,'12345678',50),
	('consumer39','password','用户39','男',20,'12345678',50),
	('consumer40','password','用户40','男',20,'12345678',50),
	('consumer41','password','用户41','男',20,'12345678',50),
	('consumer42','password','用户42','男',20,'12345678',50),
	('consumer43','password','用户43','男',20,'12345678',50),
	('consumer44','password','用户44','男',20,'12345678',50),
	('consumer45','password','用户45','男',20,'12345678',50),
	('consumer46','password','用户46','男',20,'12345678',50),
	('consumer47','password','用户47','男',20,'12345678',50),
	('consumer48','password','用户48','男',20,'12345678',50),
	('consumer49','password','用户49','男',20,'12345678',50),
	('consumer50','password','用户50','男',20,'12345678',50),
	('consumer51','password','用户51','男',20,'12345678',50),
	('consumer52','password','用户52','男',20,'12345678',50),
	('consumer53','password','用户53','男',20,'12345678',50),
	('consumer54','password','用户54','男',20,'12345678',50),
	('consumer55','password','用户55','男',20,'12345678',50),
	('consumer56','password','用户56','男',20,'12345678',50),
	('consumer57','password','用户57','男',20,'12345678',50),
	('consumer58','password','用户58','男',20,'12345678',50),
	('consumer59','password','用户59','男',20,'12345678',50),
	('consumer60','password','用户60','男',20,'12345678',50),
	('consumer61','password','用户61','男',20,'12345678',50),
	('consumer62','password','用户62','男',20,'12345678',50),
	('consumer63','password','用户63','男',20,'12345678',50),
	('consumer64','password','用户64','男',20,'12345678',50),
	('consumer65','password','用户65','男',20,'12345678',50),
	('consumer66','password','用户66','男',20,'12345678',50),
	('consumer67','password','用户67','男',20,'12345678',50),
	('consumer68','password','用户68','男',20,'12345678',50),
	('consumer69','password','用户69','男',20,'12345678',50),
	('consumer70','password','用户70','男',20,'12345678',50),
	('consumer71','password','用户71','男',20,'12345678',50),
	('consumer72','password','用户72','男',20,'12345678',50),
	('consumer73','password','用户73','男',20,'12345678',50),
	('consumer74','password','用户74','男',20,'12345678',50),
	('consumer75','password','用户75','男',20,'12345678',50),
	('consumer76','password','用户76','男',20,'12345678',50),
	('consumer77','password','用户77','男',20,'12345678',50),
	('consumer78','password','用户78','男',20,'12345678',50),
	('consumer79','password','用户79','男',20,'12345678',50),
	('consumer80','password','用户80','男',20,'12345678',50),
	('consumer81','password','用户81','男',20,'12345678',50),
	('consumer82','password','用户82','男',20,'12345678',50),
	('consumer83','password','用户83','男',20,'12345678',50),
	('consumer84','password','用户84','男',20,'12345678',50),
	('consumer85','password','用户85','男',20,'12345678',50),
	('consumer86','password','用户86','男',20,'12345678',50),
	('consumer87','password','用户87','男',20,'12345678',50),
	('consumer88','password','用户88','男',20,'12345678',50),
	('consumer89','password','用户89','男',20,'12345678',50),
	('consumer90','password','用户90','男',20,'12345678',50),
	('consumer91','password','用户91','男',20,'12345678',50),
	('consumer92','password','用户92','男',20,'12345678',50),
	('consumer93','password','用户93','男',20,'12345678',50),
	('consumer94','password','用户94','男',20,'12345678',50),
	('consumer95','password','用户95','男',20,'12345678',50),
	('consumer96','password','用户96','男',20,'12345678',50),
	('consumer97','password','用户97','男',20,'12345678',50),
	('consumer98','password','用户98','男',20,'12345678',50);

insert into `mydb`.`commodity` values
	('redtomato','食物','2012-07-12','2012-07-12',100,0.5,500,'oldtomato'),	# 1会买这个食物
    ('greentomato','衣服，食物','2012-07-12','2012-07-12',2000,0.7,800,'oldtomato'), # 2会买这个衣服
    ('blacktomato','食物','2012-07-12','2012-07-12',2000,0.7,1000,'oldtomato'),
    ('yellowtomato','食物','2012-07-12','2012-07-12',2000,0.7,2000,'oldtomato'), # 2会买这个食物
    ('bluetomato','衣服','2012-07-12','2012-07-12',2000,0.7,100,'oldtomato'),
    ('pinktomato','衣服','2012-07-12','2012-07-12',100,0.1,100,'oldtomato'), # 1会买这个衣服
    ('whitetomato','娱乐','2012-07-12','2012-07-12',100,0.7,100,'oldtomato'), # 1会买这个娱乐
    ('orangetomato','娱乐，衣服','2012-07-12','2012-07-12',2000,0.7,600,'oldtomato'), # 2会买这个娱乐
    ('browntomato','娱乐','2012-07-12','2012-07-12',2000,0.7,100,'oldtomato'),
    ('purpletomato','娱乐','2012-07-12','2012-07-12',2000,0.7,100,'oldtomato'),
    ('A食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('A娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'A'),
	('B食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('B娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'B'),
	('C食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('C娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'C'),
	('D食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('D娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'D'),
	('E食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('E娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'E'),
	('F食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('F娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'F'),
	('G食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('G娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'G'),
	('H食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('H娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'H'),
	('I食物1','食物','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I食物2','食物','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I食物3','食物','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I食物4','食物','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I衣服1','衣服','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I衣服2','衣服','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I衣服3','衣服','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I衣服4','衣服','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I娱乐1','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I娱乐2','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I娱乐3','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'I'),
	('I娱乐4','娱乐','2012-07-12','2012-07-12',50000,0.7,10,'I');

# query 
set @customer1 = (	# 用@表示用户变量
	select id
	from `mydb`.`customer`
	order by age desc
	limit 1
);

set @customer2 = (
	select id
	from `mydb`.`customer`
	order by age asc
	limit 1
);

# customer1购买，选购时与自身折扣系数无关
# food 查询
set @food1 = (
	select `name`
	from `commodity`
	where price*discount=(
		select min(t.realPrice)
		from (
			select price*discount as realPrice
			from `commodity`
			where typeName like '%食物%'
		)as t
	)
);


# cloth
set @cloth1 = (
	select `name`
	from `commodity`
	where price*discount=(
		select min(t.realPrice)
		from (
			select price*discount as realPrice
			from `commodity`
			where typeName like '%衣服%'
		)as t
	)
);

# entertainment
set @entertainment1 = (
	select `name`
	from `commodity`
	where price*discount=(
		select min(t.realPrice)
		from (
			select price*discount as realPrice
			from `commodity`
			where typeName like '%娱乐%'
		)as t
	)
);
set @customer1OrderTel = '12345678';				# 订单号100001
set @customer1OrderAddress = 'sjtu';
# insert into insertTest select * from insertTest2;
insert into `orderlist`(id,customer,tel,address,supplierId) value(100001,@customer1,@customer1OrderTel,@customer1OrderAddress,'oldtomato');
insert into `commodityorderlist`(orderId,commodityName,amount) value(100001,@food1,3);
insert into `commodityorderlist`(orderId,commodityName,amount) value(100001,@cloth1,1);
insert into `commodityorderlist`(orderId,commodityName,amount) value(100001,@entertainment1,4);

# customer2购买
# food
set @food2 = (
	select `name`
	from `commodity`
	where amount = (
		select t.amount
		from (
			select *
			from `commodity`
			where typeName like '%食物%'
		) as t
		order by t.amount desc
		limit 1
	)
);

set @cloth2 = (
	select `name`
	from `commodity`
	where amount = (
		select t.amount
		from (
			select *
			from `commodity`
			where typeName like '%衣服%'
		) as t
		order by t.amount desc
		limit 1
	)
);

set @entertainment2 = (
	select `name`
	from `commodity`
	where amount = (
		select t.amount
		from (
			select *
			from `commodity`
			where typeName like '%娱乐%'
		) as t
		order by t.amount desc
		limit 1
	)
);

set @customer2OrderTel = '12345678';				# 订单号100002
set @customer2OrderAddress = 'sjtu';
insert into `orderlist`(id,customer,tel,address,supplierId) value(100002,@customer2,@customer2OrderTel,@customer2OrderAddress,'oldtomato');
insert into `commodityorderlist`(orderId,commodityName,amount) value(100002,@food2,3);
insert into `commodityorderlist`(orderId,commodityName,amount) value(100002,@cloth2,1);
insert into `commodityorderlist`(orderId,commodityName,amount) value(100002,@entertainment2,4);


# customer1退货并填写退货理由
set @refundsOrder = (
	select id
    from `orderlist`
    where customer = @customer1 and state = '未处理'
);

update `orderlist`
set state = '已退货', reason = '点错了'
where orderlist.id = @refundsOrder;

# customer2成功接收订单并评价
set @receiveOrder = (
	select id
    from `orderlist`
    where customer = @customer2 and state = '未处理'
);

update `orderlist`
set state = '已发货', mailDate = now()
where id = @receiveOrder;

update `orderlist`
set state = '已完成'
where id = @receiveOrder;

insert into `comment` value(@receiveOrder,'买给朋友孩子的，他很喜欢',now(),3.7);

select * from customer;
select * from supplier;
select * from orderlist;
select * from commodityOrderlist;
select * from `comment`;
select * from commodity;